{
  "pages": [
    {
      "pageNum": 0,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "In the year 2122, the specific time of year holds little significance, especially when you're light-years away from any weather to experience. You're a scavenger—an explorer of abandoned wrecks, seeking anything of value that was left behind or could be salvaged. Despite the vastness of space, you're not entirely alone on this journey. Most ships come equipped with a standard personality unit known as V.I., a Virtual Intelligence designed to keep you company amidst the cosmic isolation.<br> <br> You recently received a tip about an abandoned station that reappeared on the radar not too long ago. Rumor has it, something went awry with a wormhole, or perhaps someone clumsily spilled blue milk on the main navigation computer, triggering an emergency hop into the unknown. Regardless of the specifics, what's clear is your desperate need for credits. It's a classic dilemma: risk incurring some hefty <div class='tooltip'>Federation<span class='tooltiptext'>The Galatic Federation is the biggest fish in known space, governing most inhabitant systems. You’ve only run afoul of them a few times, nothing serious. But you weren’t keen on starting now.</span></div> fines by illegally salvaging their property, or take the drastic step of selling your starship to avoid a fate where your legs end up resembling jelly.<br> <br> For you, there seems to be only one viable option...",
      "choices": [
        {
          "option": "Proceed",
          "nextPage": 1
        }
      ]
    },
    {
      "pageNum": 1,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "Shaking off the haunting thoughts of debt collectors who might decide that galactic standard time isn't the same in this sector, you resolve to seize the opportunity while it's still available. With determination fueling your actions, you initiate the hyperspace sequence, feeling the familiar hum of your ship's engines as you propel yourself towards the abandoned station. The race is on, and you're determined to get there before a swarm of scavengers beat you to the potential treasure trove.<br> <br>Bringing the ship into hyperdrive, you leave the V.I. to mind the controls. Your biggest advantage, operating solo, lies in the speed and reaction time you can afford. In a profession flooded with opportunists and a constant influx of wrecks appearing in the sector, agility is your key to staying ahead. The need for speed has become a constant companion, making the ritual of checking equipment before emerging for work a well-practiced routine. As the stars streak into lines of light, you focus on the task ahead, eager to beat the competition to the secrets that the abandoned station may hold.<br> <br>Going over your equipment, you start with what has practically become like a second skin—the trusty space suit. You're always careful with the image link hooked into the helmet. This link goes straight to V.I. back on the ship, allowing her to feed you real-time information and values of the scrap you're eyeing for salvage. But don't think the only time pressure you have is your competition; no, you also have to contend with your greatest weakness as a spacer—your need for oxygen.",
      "choices": [
        {
          "option": "Proceed",
          "nextPage": 2
        }
      ]
    },
    {
      "pageNum": 2,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "As you're about to check the condition of the tools on your suit's belt, V.I. alerts you to the closing proximity of your destination. Hyperspace travel has always been a tad more inexact than the techies would like you to believe. Nevertheless, it suited your purpose just fine as you slipped into your EVA suit and returned to the helm.<br><br>As soon as your seat cradled you, you dropped out of hyperspace just outside a debris field. Light from distant stars illuminated the shape of the station. Carefully, you piloted your freighter through the field, wincing at every small clunk of debris bouncing off the hull, too small to avoid. A few bodies amidst the wreckage seemed to have been flash-frozen, but that wasn't too abnormal for something like this.<br><br>Before long, you arrived at the most intact part of the station—the main building block and central core, referred to by shipbuilders and scrappers as module one. The colossal structure, hundreds of feet wide, was built almost in a circular fashion, part of a pillar designed to spin and maintain its position. Your sensors picked up the formerly welcoming sight of the hangar bay, where many travelers must have passed through in its prime. Now, it sat in the shadow of its own destruction, beckoning those who dared to enter its shady depths.<br><br>You've picked up a few instincts in your years of spacing through abandoned hulks of scrap. There are benefits to entering through the hangar—a faster escape, a good look at what you're getting into. The downside is, if security is still online, you might be facing at least a turret ready to shred you the moment you step into its sight.<br><br>And then there's the matter of high-value sites—officers' quarters, shops, and data banks—further inside, requiring more oxygen and time on the station. Even with the hangar approach, wandering too far from the ship is a risk.<br><br>Recalling an old trick your former employer taught you, the straightforward approach isn't the only option. The old maintenance hatches, used by engineers to access internal infrastructure, provide entry practically anywhere on the desired salvaging spot. It's a quick and easy route, but not always the best for a hasty escape. Your former employer met his demise, mauled by a <div class='tooltip'>starshade marauder<span class='tooltiptext'>Closest to the species of predatory cats located back on Earth. With the variance of surviving for extended periods in space, an extra set of legs, and the taste of humanoid spinal fluid.</span></div>, a testament to the risks involved.<br><br>Despite the potential danger, it offers more time to gather loot. As you weigh the pros and cons of each approach, considering the lure of quick rewards against the lurking threats, you make your decision...",
      "choices": [
        {
          "option": "Land in the hanger bay",
          "nextPage": 3
        },
        {
          "option": "Find a maintenance hatch",
          "nextPage": 4
        },
        {
          "option": "Just leave",
          "nextPage": 6
        }
      ]
    },
    {
      "pageNum": 3,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "Just because you`re going fast doesn`t mean you can`t take the safer of the two options. Who is to say what sort of damages those internal tunnels took during the catastrophe anyway. Better to stick with the path of least resistance.<br><br>Carefully you guide the freighter into the open maw of the hangar bay, the headlights of the ship illuminating what you aren`t too surprised about. Wrecks of ships are too numerous to count litter the inside as you maneuver to a ``parking space``. All you really manage is a place half clear of the debris, enough to maglock the landing legs to keep from bumping into things.<br><br>Although as you`re getting out of the pilot’s seat, you notice that some of the ships aren’t complete write-offs. Maybe they`d have something on board that has a profit to be made on it.<br><br>That being said, just because it holds what could be a prize inside doesn`t mean it`s worth the oxygen you`re expending looking through it when you compare it to the markets and places inside the station you can strip.",
      "choices": [
        {
          "option": "To the Markets",
          "nextPage": 16
        },
        {
          "option": "Scavenge the Ships",
          "nextPage": 17
        }
      ]
    },
    {
      "pageNum": 4,
      "vitals": 0,
      "oxygen": -2,
      "profit": 0,
      "story": "You bring your freighter around the outside of the station in a corkscrew, scanning carefully with both your experienced eyes and the ship's sensors for your target.<br><br>Towards the far end of the station module, counter to the hangar bay you originally spotted, lies the hatch. For safety purposes, in case of pirates or unforeseen space monstrosities, designers usually placed key functioning stations on the opposite end from the main hangars.<br><br>Descending the ship, you land just above the hatch before magnetizing to the station hull with the landing legs. Exiting the airlock on your freighter, you prepare for the short spacewalk to the hatch.<br><br>These hatches are designed with the assumption that, in the event of catastrophic system failure, they should be easy to open. Besides, if an unwanted guest were to use them as an entrance, the security system should be notified. Given how long this place has supposedly been inactive, you doubt many of those systems are still operational.<br><br>You open the hatch and crawl in among the piping, activating the night vision function of your helmet, painting everything in a soft blue glow. The passage isn't spacious, measuring between 2 to 2.5 feet—enough to move through but not comfortably turn around. As an experienced spacer, the claustrophobic view and navigating in your bulky suit aren't new to you.<br><br>You crawl for a couple of dozen yards until you find a connecting hatch into the station proper.<br><br>Popping your head out like a gopher, you survey the expected debris. The halls of this station have clearly seen better days, with trash littering the floors. However, the most crucial observation is the absence of signs of recent fighting or anything that might pose an immediate threat. In the limited gravity, pulling yourself into the hall is effortless.<br><br>A sign with a couple of directions catches your eye—now, which way will you choose?",
      "choices": [
        {
          "option": "The Officers' Quarters",
          "nextPage": 10
        },
        {
          "option": "The Data Banks",
          "nextPage": 11
        },
        {
          "option": "The Bridge",
          "nextPage": 12
        }
      ]
    },
    {
      "pageNum": 5,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "Return to the ship",
      "choices": [
        {
          "option": "Leave",
          "nextPage": 7
        },
        {
          "option": "Refill air and head back inside",
          "nextPage": 7
        }
      ]
    },
    {
      "pageNum": 6,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "''<div class='tooltip'>Doints <span class='tooltiptext'>A common practice that ended up being picked up by star pilots and spacers alike is to swear in mathematical terms to cut down on profanity, this one in particular being shorted from ''Decimal Point''</span></div> to this!'' you say to yourself. <br> <br> You decide that the debt collectors are the better call. At least with them you know what to expect...",
      "choices": [
        {
          "option": "But don't you want to actually try?",
          "nextPage": 0, 
          "key": 1
        }
      ]
    },
    {
      "pageNum": 7,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "Unknown Page",
      "choices": [
        {
          "option": "Start Again?",
          "nextPage": 0
        }
      ]
    },
    {
      "pageNum": 8,
      "vitals": -3,
      "oxygen": 0,
      "profit": 0,
      "story": "Whether it be by a mishap with a machine or a monster that wants to eat your bones. <br> <br> It doesn't really matter now... <br> <br> Because you're <span style='font-weight: bold; text-decoration: underline;'> dead</span>. <br> <br> Sorry to break it to you...",
      "choices": [
        {
          "option": "Want to try again?",
          "nextPage": 0
        }
      ]
    },
    {
      "pageNum": 9,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "As the last of your remaining oxygen is drained from your oxygen tanks, the warning alarms notifying you that you have taken what should have been your last breath... <br> <br> This should be alarming, a fear gripping your heart... <br> <br> But the most depressing part is that your final thought is a stupid metal song from the 21st century",
      "choices": [
        {
          "option": "Want to try again?",
          "nextPage": 0
        }
      ]
    },
    {
      "pageNum": 10,
      "vitals": 0,
      "oxygen": -2,
      "profit": 0,
      "story": "Choosing the Officers' Quarters as your starting point makes sense. Your experience tells you that most station officers tend to be more concerned with lining their own pockets than maintaining order. You recall the guy responsible for parking fees back at Ritzico City, always finding ways to fleece spacers for as long as you can remember.<br><br>As you carefully make your way down the hall, you take solace in imagining stripping down that particular officer's place to the piping. The only sounds accompanying you are the echoing stomps of your boots, magnetizing and demagnetizing on the metallic floor, now devoid of the atmosphere that once filled this space.<br><br>Passing more heaps of debris, you notice what appear to be electrical burn marks along some of the hallway plating. They create a peculiar connect-the-dots picture across the hall. A little further down, you spot the sign that once proudly read ''Officers' Quarters,'' its glowing letters now dark and lifeless like the rest of the station.<br><br>Hopefully, you won't be joining them.",
      "choices": [
        {
          "option": "Enter the quarters",
          "nextPage": 13
        }, {
          "option": "Wait, what was that about scortch marks?",
          "nextPage": 14
        }
      ]
    },
    {
      "pageNum": 11,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "Go to the Data Banks",
      "choices": [
        {
          "option": "Want to try again?",
          "nextPage": 0
        }
      ]
    },
    {
      "pageNum": 12,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "Go to the Bridge",
      "choices": [
        {
          "option": "Want to try again?",
          "nextPage": 0
        }
      ]
    },
    {
      "pageNum": 13,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "Enter the Officers' Quarters",
      "choices": [
        {
          "option": "Want to try again?",
          "nextPage": 0
        }
      ]
    },
    {
      "pageNum": 14,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "Wait, what was that about scortch marks?",
      "choices": [
        {
          "option": "Carefully enter the Officers' Quarters",
          "nextPage": 15
        }
      ]
    },
    {
      "pageNum": 15,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "Carefully enter the Officers' Quarters",
      "choices": [
        {
          "option": "Want to try again?",
          "nextPage": 0
        }
      ]
    },
    {
      "pageNum": 16,
      "vitals": 0,
      "oxygen": -4.5,
      "profit": 0,
      "story": "Stepping out from the hangar into the dark, awaiting halls of the station's interior, you find yourself in the depressurized part of the module. The only sound greeting you is the rhythmic clunk of your boots magnetizing and demagnetizing to the floor as you walk. You consider whistling for a moment, but the tight confines of your helmet make you think better of that impulse.<br><br>Continuing your trek towards the markets, you follow the garishly painted arrows and signs displayed first thing through the hangar door. The halls don't surprise you – luggage floats loose from those trying to escape, and some corpses remain half-preserved in the vacuum. You sift through some of the luggage as you wander through until you reach the market proper.<br><br>Most stations you've been in had a mix of strip mall meets bazaar, and this module is no different. To your surprise, however, this is the first indication of what might have happened to the station – proof that it wasn't a quiet drifting off into the night.<br><br>Some booths that litter the hallway where people would hawk wares are riddled with blaster markings, others destroyed outright. One booth even has the destroyed remains of a security droid. Upon closer inspection, it seems that the power cell overheated or one of the cooling lines ruptured, causing a catastrophic malfunction that made its upper body explode like an egg in a microwave.<br><br>Either way, it was either extremely lucky for the attacker or something just that deadly. Regardless, you hope you won't have to find out and turn your attention towards your objective.<br><br>As you glance around, you notice some of the stores that have weathered the passage of time since the station's disappearance. Unfortunately, most of them seem to offer only trinkets and gift-shop-level items. It's the common pitfall of markets near the main hangar, trying to entice you with novelty before you embark on your journey, whether it be to stay or to leave.<br><br>On the other hand, scattered booths present themselves throughout the area. Granted, some bear the scars of an apparent skirmish that unfolded here some time ago. Yet, the intact ones, resilient against the whims of fate, might still hold something of value.",
      "choices": [
        {
          "option": "Try the Stores",
          "nextPage": 7
        },{
          "option": "No, the Booths",
          "nextPage": 7
        }
      ]
    },
    {
      "pageNum": 17,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "Even if it wasn`t the jackpot, profit is profit is profit. All adds up in the end. That was your thought moving down the boarding ramp and out into the ruins of the shipyard.<br><br>Many of the ships seemed to have been damaged in what must have been the tumble of warp travel. Worthless odds and ends of different ships laid beaten and battered all around you in heaps, but two stood out amongst the rest.<br><br>On, what is currently your ceiling, you can see where a freighter with wide thrusters seemed to have plowed into the ceiling, burying its nose cone up to the front landing leg. You hazard a guess that it must’ve been one of the few that tried to escape but must have waited too long to do so or the pilot got jumpy and panicked.<br><br>The other ship that catches your eye seemed to be one that looked like it was owned by someone who must’ve been loaded. How can you identify that? Well, you see a lot of rich folks spend their wealth on ships that aren’t truly meant for flying. This ship is shaped more like a pear than a proper ship. The only ship still intact was on its landing legs. Designed with more accessories than actually necessary bits.<br><br>You didn’t quite travel in those circles much, but you know that many pirates refer to this kind of ship as “the dinner bell” because of its shape and being a payday for any of your less honor-bound cohorts.",
      "choices": [
        {
          "option": "The Crashed Ship",
          "nextPage": 18
        },{
          "option": "The Yacht",
          "nextPage": 19
        }
      ]
    },
    {
      "pageNum": 18,
      "vitals": 0,
      "oxygen": -6.5,
      "profit": 3000,
      "story": "Looking back up to the ceiling, you leap off the floor, propelling yourself towards the ship without bothering to use any of your limited jump juice for course correction.<br><br>In your approach, you get a nice view of the ship. It's a faster model, not quite a fighter craft, but the wear and tear suggests it's a proper spacer's craft, not some wannabe. It's not too dissimilar to your own, now that you think about it.<br><br>Using a tiny bit of jump juice to soften the landing, you arrive at the opening to the cargo bay. The crash left the hatch slightly askew, and while repairing it would be a hassle, you don't need to worry about that.<br><br>You take out the favorite tool in your toolbox—the Space Tool for Extraterrestrial Work or S.T.E.W. for short. This cylindrical device with a control panel near the handle contains various tools in a compact design, maybe larger than a standard fire extinguisher. From an illuminator to a welder, the latter is your preferred pick for this task. The front barrel of S.T.E.W. splits into four claws, forming a containment field for a plasma blade. Carefully cutting out the hatch, you make the opening large enough to avoid squeezing through.<br><br>Crawling inward, you find the cargo bay filled with the exact kinds of treasures you're looking for. It's almost as if someone did all the work for you, stripping down what must have been the yacht you spotted still parked in the hangar. However, reality hits when you realize how badly damaged most of it is—a collection of Fabergé eggs smashed to pieces, designer clothes burned from a fuel line rupture, and fancy furniture with real wood now damaged beyond repair. All because someone didn't know how to properly secure cargo in an emergency.<br><br>Just as you're about to give up in frustration, you decide to check the cockpit, crawling your way through the bent halls to the main deck where the pilot seems to have had a real tough time. Much of their body is reduced to mush, making it difficult to identify the species. There are some human-looking limb arrangements, but then there's this weird tail of black carapace—unidentifiable.<br><br>Disappointing, but you're not ready to be discouraged yet. As you turn to crawl back out, you notice a small box floating in a corner. Upon investigation, you find it contains a strange glass chalice. This could be worth something.",
      "choices": [
        {
          "option": "To the Markets",
          "nextPage": 16
        },{
          "option": "The Yacht",
          "nextPage": 20
        }
      ]
    },
    {
      "pageNum": 19,
      "vitals": 0,
      "oxygen": -6,
      "profit": 500,
      "story": "Instead of trying to find a path around the rubble of destroyed ships that block your way to the yacht, you stretch your legs and take a running jump towards the more expensive starship. With artificial gravity inactive on the station, your leap lacks the usual graceful arc of a normal jump. Instead, you propel yourself forward, overshooting the yacht slightly—fortunately, that's what your jump juice is for.<br><br>Using a small burst of air from your suit's propulsion system, you correct your trajectory to land on the side of the yacht. As you take out the favorite tool in your toolbox—the Space Tool for Extraterrestrial Work or S.T.E.W. for short—you notice that the closest hatch is already cut open, similar to a tool like S.T.E.W.<br><br>This is never a good sign, and out of habit, you approach with a hand on the cylindrical tool's handle. It's not necessarily a weapon, but it's better than nothing. Worry sinks into your gut like a stone, wondering if another scavenger beat you to the station, and you simply missed their vessel. There could be a hidden danger that caused the station's fall, like a horde of killer robots hellbent on rending flesh from bone, waiting inside for you.<br><br>But no, nothing could be worse than what you see when you look inside. Nothing fills you with more horror than spotting that the interior of the yacht is stripped bare of anything of value. You frantically check the drawers of the remaining furniture, any closets in the rooms, under the floating beds—no longer connected to the flooring as looters even took some of the carpeting.<br><br>You manage to find a couple of knick-knacks the looters must've missed, but so far, nothing to make this trip worthwhile. The air in your suit feels thinner as you weigh your options in the eerie silence of the stripped yacht.",
      "choices": [
        {
          "option": "To the Markets",
          "nextPage": 16
        },{
          "option": "The Crashed Ship",
          "nextPage": 21
        }
      ]
    },
    {
      "pageNum": 20,
      "vitals": 0,
      "oxygen": -6.5,
      "profit": 300,
      "story": "From your vantage point in the cut-open cargo bay, you easily spot the yacht. With a stretch of your legs, you take a running jump towards the more expensive starship, ensuring a clear descent with your angle on the vessel.<br><br>Using a small burst of air from your suit's propulsion system, you correct your trajectory to land on the side of the yacht. As you take out the favorite tool in your toolbox again, you notice that the closest hatch is already cut open, likely with a similar tool to the S.T.E.W.<br><br>This is never a good sign, and out of habit, you approach with a hand on the cylindrical tool's handle. It's not necessarily a weapon, but it's better than nothing. Worry sinks into your gut like a stone, wondering if another scavenger beat you to the station, and you simply missed their vessel. There could be a hidden danger that caused the station's fall, like a horde of killer robots hellbent on rending flesh from bone, waiting inside for you.<br><br>But no, nothing could be worse than what you see when you look inside. Nothing fills you with more horror than spotting that the interior of the yacht is stripped bare of anything of value. This must have been where the crashed vessel got all its loot, apparently stopping for a robbery before fleeing the station—their greed likely causing their crash.<br><br>Not expecting to find much left behind, you do one token search of the rooms that you'd guess held value, coming up with a handful of trinkets that likely won't sell for much, but at least it's something. The disappointment lingers as you float in the stripped-down interior, contemplating your next move in the eerie silence of the looted yacht.",
      "choices": [
        {
          "option": "To the Markets",
          "nextPage": 16
        }
      ]
    },
    {
      "pageNum": 21,
      "vitals": 0,
      "oxygen": -3,
      "profit": 3000,
      "story": "Stepping out of the hatch you entered from, you look back up to the ceiling, searching for your other target before you spot it and take the leap. You propel yourself towards the ship without bothering to use any of your limited jump juice for course correction.<br><br>In your approach, you get a nice view of the ship. It's a faster model, not quite a fighter craft, but the wear and tear suggests it's a proper spacer's craft, not some wannabe. It's not too dissimilar to your own, now that you think about it.<br><br>Using a tiny bit of jump juice to soften the landing, you arrive at the opening to the cargo bay. The crash left the hatch slightly askew, and while repairing it would be a hassle, you don't need to worry about that.<br><br>You take out the Space Tool for Extraterrestrial Work or S.T.E.W. properly this time. The cylindrical device with a control panel near the handle contains various tools in a compact design, maybe larger than a standard fire extinguisher. From an illuminator to a welder, the latter is your preferred pick for this task. The front barrel of S.T.E.W. splits into four claws, forming a containment field for a plasma blade. Carefully cutting out the hatch, you make the opening large enough to avoid squeezing through.<br><br>Crawling inward, you find the cargo bay filled with the spoils you realize must have come from the yacht. Although it isn't all good news, as you realize how badly damaged most of it is—a collection of Fabergé eggs smashed to pieces, designer clothes burned from a fuel line rupture, and fancy furniture with real wood now damaged beyond repair. All because someone didn't know how to properly secure cargo in an emergency.<br><br>Just as you're about to give up in frustration, you decide to check the cockpit, crawling your way through the bent halls to the main deck where the pilot seems to have had a real tough time. Much of their body is reduced to mush, making it difficult to identify the species. There are some human-looking limb arrangements, but then there's this weird tail of black carapace—unidentifiable.<br><br>Disappointing, but you're not ready to be discouraged yet. As you turn to crawl back out, you notice a small box floating in a corner. Upon investigation, you find it contains a strange glass chalice. This could be worth something if nothing else. The air in the stripped-down cargo bay feels thick with disappointment, but you press on, determined to salvage what you can from this wrecked station.",
      "choices": [
        {
          "option": "To the Markets",
          "nextPage": 16
        }
      ]
    },
    {
      "pageNum": 22,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "The Stores",
      "choices": [
        {
          "option": "Want to try again?",
          "nextPage": 0
        }
      ]
    },
    {
      "pageNum": 23,
      "vitals": 0,
      "oxygen": 0,
      "profit": 0,
      "story": "The Booths",
      "choices": [
        {
          "option": "Want to try again?",
          "nextPage": 0
        }
      ]
    }
  ]
}
